# UAV-Tiny-Object-Detection
# https://github.com/Seven-zxy/UAV-Tiny-Object-Detection
#
# YOLO26s + EMA (Efficient Multi-scale Attention).
# Based on the upstream yolo26.yaml, with three EMA modules inserted at the
# neck outputs (P3/P4/P5), each applied AFTER the final neck feature of its
# scale and BEFORE the Detect head.
#
# Reference: "Efficient Multi-Scale Attention Module", ICASSP 2023.
# Channels are auto-scaled by the width multiplier (scale 's' => 0.5).
#
# Reference result (Phase-1 best YOLO26s variant):
#   val mAP@0.5: 0.581 -> 0.623 (+4.2 pp), Recall +12.5% rel.
#
# License: Apache-2.0

# Parameters
nc: 1  # number of classes (single-class detection)
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone (identical to upstream yolo26.yaml)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]]  # 9
  - [-1, 2, C2PSA, [1024]]             # 10

# Head with EMA (3 EMA modules, one per detection scale, before Detect)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                     # 12: cat backbone P4
  - [-1, 2, C3k2, [512, True]]                    # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 4], 1, Concat, [1]]                     # 15: cat backbone P3
  - [-1, 2, C3k2, [256, True]]                    # 16 (P3/8-small)
  - [-1, 1, EMA, [256]]                           # 17  EMA on P3 output

  - [-1, 1, Conv, [256, 3, 2]]                    # 18
  - [[-1, 13], 1, Concat, [1]]                    # 19: cat head P4
  - [-1, 2, C3k2, [512, True]]                    # 20 (P4/16-medium)
  - [-1, 1, EMA, [512]]                           # 21  EMA on P4 output

  - [-1, 1, Conv, [512, 3, 2]]                    # 22
  - [[-1, 10], 1, Concat, [1]]                    # 23: cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]]        # 24 (P5/32-large)
  - [-1, 1, EMA, [1024]]                          # 25  EMA on P5 output

  # Detect indices shifted to [17, 21, 25] to account for the 3 EMA layers
  - [[17, 21, 25], 1, Detect, [nc]]
